Repository: Acidburn0zzz/srcrepair
Catalog: srcrepair/AppStrings.*.resx
Languages: ru

# BackUpCreationFailed
source: An error occurred while creating the backup. Backup has been created!
ru: Произошла ошибка при создании резервной копии. Резервная копия не была создана!

# CE_CfgSV
source: Save the configuration file?
ru: Сохранить файл конфигурации?

# CE_CfgSVVEx
source: Attention! When saving a file error occurred. File was not saved!
ru: Внимание! Во время сохранения файла произошла ошибка. Файл не был сохранён!

# CE_CreateBackUp
source: Create a backup file
ru: Создать резервную копию файла

# CE_ExceptionDetected
source: Warning! Parse error detected. Probably the config is opened not completely or with errors.
ru: Внимание! Во время открытия файла произошла ошибка парсера. Возможно, конфиг открыт не полностью, либо с ошибками.

# CE_OpenFailed
source: Can not read the contents of the config, as file not found!
ru: Невозможно считать содержимое конфига, т.к. файл не найден!

# CE_RestConfigOpenWarn
source: Attention! It is not recommended to edit this file, because this may lead to unpredictable consequences. Edit it at your own risk.
ru: Внимание! Настоятельно не рекомендуется редактировать этот файл, т.к. это может привести к непредсказуемым последствиям. Редактируйте его на свой страх и риск.

# FP_InstallFailed
source: A critical error: can not install the selected config!
ru: Произошла критическая ошибка: невозможно установить выбранный конфиг!

# FP_InstallQuestion
source: Attention! Setting FPS-config reduce all graphics settings to the absolute minimum that will lead to significant deterioration of the quality of game graphics and game performance increase. Are you sure you want to set the FPS-config?
ru: Внимание! Установка FPS-конфига снизит все графические настройки на абсолютный минимум, что приведёт к значительному ухудшению качества графики игры и увеличению производительности игры. Вы уверены, что хотите установить FPS-конфиг?

# FP_InstallSuccessful
source: Config has been successfully installed!
ru: Конфиг был успешно установлен!

# FP_NoCfgGame
source: Attention! For the selected game we do not have FPS-config, so this page will be disabled!
ru: Внимание! Для выбранной игры у нас нет FPS-конфигов, поэтому данная страница будет недоступна!

# FP_NoDescr
source: Unfortunately, the description of the chosen config is not available. We apologize for any inconvenience.
ru: К сожалению, описание выбранного Вами конфига недоступно. Приносим извинения за доставленные неудобства.

# FP_RemoveFailed
source: An error occurred while removing the installed config!
ru: Произошла ошибка при удалении установленного конфига!

# FP_RemoveNotExists
source: Needless to delete: FPS-config for the current game is not installed!
ru: Нечего удалять: для текущей игры FPS-конфиги не установлены!

# FP_RemoveSuccessful
source: Installed FPS-config has been successfully deleted!
ru: Установленный FPS-конфиг был успешно удалён!

# FrmCloseQuery
source: Close {0}?
ru: Закрыть программу {0}?

# GeneralErrorDetected
source: Found an unhandled exception. Please inform the developers email: vitaly@easycoding.org.
ru: Обнаружено исключение, которое мы не смогли обработать. Пожалуйста, сообщите разработчикам на email: vitaly@easycoding.org.

# GT_DxLevelMsg
source: Enable DirectX 8 mode rendering? This will significantly increase the performance of the game.
ru: Включить DirectX 8 режим рендера? Это значительно увеличит производительность игры.

# GT_FPSCfgDetected
source: Attention! An installed FPS-config detected, so the settings from this page except the DirectX mode will be ignored by the game until you remove this config.
ru: Внимание! Обнаружен установленный FPS-конфиг, поэтому настройки с этой страницы кроме режима DirectX будут игнорироваться игрой до удаления FPS-конфига.

# GT_MaxPerfMsg
source: Do you really want to set the graphics settings to the recommended maximum? This will require a powerful computer!
ru: Вы действительно хотите установить настройки графики на рекомендуемый максимум? Для этого потребуется мощный компютер!

# GT_MinPerfMsg
source: Do you really want to install all the video settings to minimum? This will increase the FPS, but worsen the graphics in the game.
ru: Вы действительно хотите установить все настройки видео на минимальные? Это увеличит FPS, но ухудшит графику в игре.

# GT_PerfSet
source: Done. Do not forget to adjust and save the changes in the settings!
ru: Готово. Не забудьте подкорректировать и сохранить изменения в настройках!

# GT_SaveMsg
source: Save your changes?
ru: Сохранить сделанные Вами изменения?

# GT_SaveSuccess
source: Changes have been successfully saved!
ru: Изменения были успешно сохранены!

# InputBoxCancelBtnName
source: Cancel
ru: Отмена

# ST_KillMessage
source: To work correctly, this programm needs {0} to be shut down. Proceed?
ru: Внимание! В памяти обнаружен активный процесс {0}! Настоятельно рекомендуется завершить его работу во избежании серьёзных ошибок. Завершить работу этого процесса сейчас?

# NotImplementedYet
source: Sorry, but this feature is not yet implemented!
ru: Извините, но данная функция ещё не реализована!

# ParamError
source: Discovered the command line parameter, but not found its value, so ignore this option!
ru: Обнаружен параметр командной строки, но не обнаружено его значение, поэтому игнорируем данный параметр!

# PS_ExecuteMSG
source: Perform the cleanup?
ru: Выполнить очистку?

# PS_NoLangSelected
source: You chose the wrong language Steam from the dropdown list, so we will use English!
ru: Вы неправильно выбрали язык Steam из выпадающего списка, поэтому будет использоваться английский!

# PS_NothingSelected
source: You do not choose! Please select at least one of the options of cleaning and run the cleanup again!
ru: Вы ничего не выбрали! Выберите хотя бы одну из опций очистки и повторите запуск!

# PS_ProcessTerminated
source: Steam has been successfully terminated.
ru: Внимание! В памяти был обнаружен запущенный процесс Steam. Steam был успешно завершён.

# PS_SeqCompleted
source: Cleanup completed successfully. Steam will run in recovery mode right now!
ru: Очистка успешно выполнена. Steam будет запущен в режиме восстановления прямо сейчас!

# StatusLoginChanged
source: Steam login was successfully changed. Let's continue to work with the new one...
ru: Логин Steam был успешно сменён. Продолжаем работу с новым...

# StatusNormal
source: All systems are working normally.
ru: Все системы работают в штатном режиме.

# StatusOpenedFile
source: Opened file in Config Editor:
ru: В редакторе открыт файл: {0}.

# StatusSApp
source: Please select game from the list!
ru: Пожалуйста, выберите игру из списка!

# StatusSLogin
source: Please select your Steam login from the list!
ru: Пожалуйста, выберите Ваш логин Steam из списка!

# SteamLoginCancel
source: You refused to enter your login Steam, so the work program is impossible. Restart this program later and enter the correct login!
ru: Вы отказались вводить свой логин Steam, поэтому работа программы невозможна. Повторите запуск позднее и введите правильный логин!

# SteamLoginEnterText
source: Please enter your Steam login:
ru: Введите Ваш логин Steam:

# SteamLoginEnterTitle
source: Enter Steam login
ru: Ввод логина

# SteamLoginsNotDetected
source: Attention! Source Repair was unable to get a list of active logins Steam, so you have to enter it manually.
ru: Внимание! Source Repair не смог получить список активных логинов Steam, поэтому Вам придётся ввести его вручную.

# SteamNonASCIIDetected
source: Attention! On the way to Steam detected invalid characters: Russian, German, etc. letters, or Unicode characters. Steam and the games will not work correctly. Reinstall Steam folder, the path to which will contain only latin symbols.
ru: Внимание! В пути к Steam обнаружены недопустимые символы. Steam и игры будут работать с ошибками. Переустановите Steam в папку, путь до которой будет содержать только латинские буквы.

# SteamNotDetected
source: Registry keys related to Steam is not found. You do not need their cleaning. Click OK to exit the program!
ru: Ключи реестра, относящиеся к Steam не обнаружены. Вам не нужна их чистка. Нажмите OK для выхода из программы!

# SteamPathCancel
source: You refused to enter the path to Steam, so the program will be terminated!
ru: Вы отказались вводить путь к Steam, поэтому программа будет завершена!

# SteamPathEnterErr
source: You have entered the wrong path! The program will be terminated.
ru: Вы указали неправильный путь! Программа будет завершена.

# SteamPathEnterText
source: Specify the path to Steam:
ru: Укажите путь к установленному Steam:

# SteamPathEnterTitle
source: Specify the path to Steam
ru: Укажите путь к Steam

# SteamPathNotDetected
source: Warning! Critical error occured: can not get the path to the Steam from the registry, so you'll have to manually specify the correct path!
ru: Произошла критическая ошибка: не могу получить путь к Steam из реестра, поэтому Вам придётся вручную указать правильный путь!

# UnnamedFileName
source: Unnamed.cfg
ru: Безымянный.cfg

# FP_SelectFromList
source: Select the config file from the list above!
ru: Выберите конфиг из списка выше!

# PS_CleanupErr
source: Error occured while deleting files. Some files were not deleted!
ru: Во время удаления файлов произошла ошибка. Некоторые файлы не были удалены!

# PS_CleanupExecuteQ
source: Clean selected {0}?
ru: Удалить выбранные файлы ({0})?

# PS_CleanupSuccess
source: Cleanup was successfully completed!
ru: Процесс очистки успешно завершён!

# AppLangPrefix
source: en
ru: ru

# GT_ResMsg
source: Specify the {0} resolution of the monitor or window. You must specify an integer.
ru: Укажите разрешение монитора или окна по {0}. Необходимо указать целое число.

# GT_ResMsgHor
source: horisontal
ru: горизонтали

# GT_ResMsgVert
source: vertical
ru: вертикали

# PS_ResetSettingsMsg
source: Are you sure you want to restore factory game settings? This will remove all non-standard and old files and settings stored in Windows registry.
ru: Вы уверены, что хотите сбросить все настройки игры? Будут удалены все нестандартные и старые файлы, а также настройки, хранящиеся в реестре.

# RPB_CloseCpt
source: Close
ru: Закрыть

# RPB_ComprGen
source: Compressed report with the name {0} has been successfully created! Now we will open the directory with generated report file in order that you can upload it to technical support service.
ru: Сжатый отчёт с именем {0} был успешно создан! Сейчас будет открыт каталог с отчётом для того, чтобы Вы смогли загрузить его на форум.

# RPB_CptWrk
source: Working... Please wait.
ru: Ждите. Работаю...

# RPB_Generated
source: Report with the name {0} has been successfully created! Now we will open the directory with generated report file in order that you can upload it to technical support service.
ru: Отчёт с именем {0} был успешно создан! Сейчас будет открыт каталог с отчётом для того, чтобы Вы смогли загрузить его на форум.

# RPB_GenException
source: An error has occurred. Unable to execute tool Microsoft System Information. Perhaps it is not installed on this operating system. Creating a report is impossible.
ru: Произошла ошибка. Невозможно выполнить утилиту Microsoft System Information. Возможно, она не установлена в данной ОС. Создание отчёта невозможно.

# FPW_Success
source: Your own FPS-config was successfully generated and loaded to Config Editor. You can now edit it manually. Please save it as autoexec.cfg to apply in game.
ru: FPS-конфиг был успешено сгенерирован и отправлен в Редактор конфигов для дальнейшего изменения или сохранения. Чтобы сохранить результат, нажмите в редакторе кнопку Сохранить изменения.

# QI_Excpt
source: There was an error during file installation. Please try again later!
ru: Произошла ошибка во время установки выбранного файла!

# QI_GenVMTMsg
source: Generate VMT file automatically?
ru: В каталоге со спреем не найден VMT-файл. Сгенерировать его автоматически?

# QI_InstSuccessfull
source: Installation completed successfully!
ru: Установка выбранного файла успешно завершена!

# QI_InstUnav
source: Please select file before pressing this button and try again!
ru: Установка невозможна, т.к. Вы не выбрали файл, который нужно установить. Выберите файл и повторите попытку!

# BU_DelFailed
source: There was an error occured. File was not removed!
ru: Произошла ошибка при попытке удаления файла резервной копии. Файл не был удалён!

# BU_DelMsg
source: Remove selected backup file?
ru: Вы уверены, что хотите удалить выбранный файл резервной копии?

# BU_DelSuccessful
source: Backup was successfully removed!
ru: Выбранный файл резервной копии был успешно удалён!

# BU_NoFiles
source: No backup files detected. Please, refresh list and try again later!
ru: Действие невозможно: список резервных копий пуст!

# BU_QMsg
source: Restore file {0} of {1}?
ru: Вы уверены, что хотите восстановить файл {0} от {1}?

# BU_RestFailed
source: There was an error occured. BackUp was not restored!
ru: Произошла ошибка при попытке восстановить резервную копию. Файл не был восстановлен!

# BU_RestSuccessful
source: BackUp was successfully restored!
ru: Резервная копия была успешно восстановлена!

# BU_TBSelCat
source: Please select item from drop-down list!
ru: Пожалуйста выберите резервную копию чего Вы хотите создать из выпадающего списка!

# BU_RegCreate
source: Create registry backup now?
ru: Создать резервную копию сейчас?

# BU_RegDone
source: Registry backup was successfully created!
ru: Файл резервной копии реестра был успешно создан!

# BU_RegErr
source: There was an error occured. Backup file was not created!
ru: Произошла ошибка при создании резервной копии реестра. Файл не был создан!

# BU_ListLdFailed
source: There was an error occured. Can't get list of backups. Create at least one backup and try again later.
ru: Произошла ошибка: не могу найти каталог с резервными копиями. Создайте хотя бы одну резервную копию и повторите попытку позднее!

# CE_ClNoDescr
source: Unfortunately we have no description for this variable. You can help by sending it to us.
ru: К сожалению, для этой переменной у нас нет описания. Вы можете помочь проекту, прислав его нам.

# CE_ClSelErr
source: No variables detected in selected row!
ru: Переменная в выделенной строке не найдена!

# AHE_ExceptionDetected
source: Warning! Parse error detected. Probably file {0} is opened not completely or with errors.
ru: Во время открытия файла {0} произошла ошибка. Файл может быть открыт некорректно!

# AHE_RestDef
source: Restore default Hosts file?
ru: Восстановить стандартные значения файла Hosts?

# AHE_Saved
source: File hosts was successfully saved!
ru: Изменения в файле hosts были успешно сохранены!

# AHE_SaveException
source: Attention! An error occurred while writing to file {0}. Maybe you have not enough rights for this or someone is blocking write attempts.
ru: Внимание! Произошла ошибка во время записи в файл {0}. Возможно, у вас недостаточно для этого прав, либо кто-то блокирует попытку записи.

# PS_LoadErr
source: Cleanup is not required.
ru: Файлы для удаления не найдены! Очистка не требуется.

# PS_SelectItemsMsg
source: Files for cleanup is not selected! Please select files and try again later.
ru: Файлы для очистки не выбраны! Пожалуйста выберите файлы для очистки из списка и повторите попытку.

# AppNoGamesDetected
source: Attention! SRC Repair can't detect any installed supported games. Please run your desired game from Steam at least once. After that, they will appear in the list and you will be able to manage them by this program.
ru: Внимание! Не обнаружено ни одной управляемой игры. Пожалуйста, запустите нужные Вам игры из Steam хотя бы один раз. После этого они появятся в списке и Вы сможете ими управлять средствами данной программы.

# AppNoSTADetected
source: Fatal error! Can't read directory SteamApps. Maybe it does not exists or you do not have necessary rights. Further program execution is impossible. Install and run at least one game from Steam and then use this program again.
ru: Критическая ошибка! Не могу прочитать каталог SteamApps. Возможно, он не существует, либо у Вас нет прав на его чтение. Дальнейшее выполнение программы невозможно. Установите и запустите хотя бы одну игру из Steam, затем данную программу.

# BU_BName_GameAuto
source: Graph. options autobackup of
ru: Автокопия настроек игры от

# BU_BName_GRGame
source: Graph. settings of
ru: Граф. настройки от

# BU_BName_SRCAll
source: All SRC graph. settings of
ru: Граф. настройки всех игр от

# BU_BName_SteamAll
source: Steam options of
ru: Настройки Steam от

# BU_BType_Cfg
source: Config
ru: Конфиг

# BU_BType_Reg
source: Registry
ru: Реестр

# UPD_DownloadException
source: An error occurred while trying to download updates! Allow the program to get data from the Internet and try again later.
ru: Произошла ошибка при попытке скачать файл обновлений! Разрешите программе получить данные из сети Интернет и повторите попытку позднее.

# UPD_ExceptionDetected
source: An error occurred while checking for updates! Allow the program to get data from the Internet and try again later.
ru: Произошла ошибка во время проверки обновлений! Разрешите программе получить данные из сети Интернет и повторите попытку позднее.

# UPD_LatestInstalled
source: Update is not required because you have the latest version of the program.
ru: Обновление не требуется, т.к. у Вас установлена последняя версия программы.

# UPD_UpdateFailure
source: An error occurred while trying to run installer. The program has not been updated. Run the update again later!
ru: Произошла ошибка при попытке запуска программы установки новой версии. Программа не была обновлена. Запустите обновление повторно позднее!

# UPD_UpdateSuccessful
source: The new version has been successfully received from server. We will install it now!
ru: Новая версия была успешно получена с сервера. Сейчас будет произведена её установка!

# Opts_Error
source: Attention! An error occurred while saving!
ru: Внимание! Произошла ошибка при попытке записи настроек!

# Opts_Saved
source: Application settings were saved successfully. Attention! Some of them will be activated only after restarting the program.
ru: Настройки были успешно сохранены. Внимание! Некоторые из них будут задействованы только после перезапуска программы.

# PS_CleanupFull
source: Clean {0}?
ru: Удалить {0}?

# GT_SaveFailure
source: An error occurred while saving graphical settings!
ru: Произошла ошибка при попытке сохранения графических настроек!

# BU_NoSelected
source: Action is impossible: no files selected!
ru: Действие невозможно: не выбрано ни одного файла!

# KB_ExException
source: An error occurred during execution. Make sure you have administrator rights!
ru: Произошла ошибка при выполнении. Убедитесь, что у Вас есть права администратора!

# KB_ExQuestion
source: Are you sure you want to {0}?
ru: Вы уверены, что хотите {0}?

# KB_ExRestore
source: Restore default settings?
ru: Восстановить настройки по умолчанию?

# KB_ExSuccess
source: The required action successfully completed!
ru: Требуемое действие успешно выполнено! Выполненные настройки будут применены после перезагрузки системы.

# AppUpdateAvailable
source: Notice! Update for {0} is available. We recommend you upgrade as soon as possible via the menu Help - Check for updates, or manually.
ru: Внимание! Доступно обновление программы {0}. Рекомендуем Вам обновиться как можно скорее через меню Справка - Проверить наличие обновлений, либо вручную.

# AppXMLParseError
source: An error occurred while parsing XML file with a list of games. Perhaps it is missing or damaged. Please reinstall the program.
ru: Произошла ошибка при разборе XML файла со списком игр. Возможно он отсутствует или повреждён. Пожалуйста, переустановите программу.

# AHE_HMessg
source: Hosts file: {0}. Show it in Windows Explorer?
ru: Активный файл hosts расположен в: {0}. Показать в Проводнике?

# SteamNonASCIINotDetected
source: Steam installed correctly: Steam login and directory path does not contain illegal characters: letters of national alphabets (Russian, German, French, etc.) and Unicode characters.
ru: Steam установлен верно: путь к каталогу Steam не содержит запрещённых символов.

# PS_CleanEmptyDirsError
source: An error occurred during the clean up empty directories! Maybe you do not have appropriate access rights.
ru: Произошла ошибка во время очистки пустых каталогов! Возможно, у Вас нет соответствующих прав доступа.

# AppCheckingForUpdates
source: Checking for Updates... Please wait.
ru: Идёт проверка обновлений... Пожалуйста, подождите!

# SteamCloudChanged
source: Steam Cloud settings was successfully changed!
ru: Настройки Steam Cloud были успешно переключены!

# SteamCloudStatusOff
source: disabled
ru: выключен

# SteamCloudStatusOn
source: enabled
ru: включён

# PS_CleanException
source: An error occurred during cleanup. Perhaps you have no rights necessary for this action.
ru: Произошла ошибка во время процедуры очистки. Возможно, у Вас отсутствуют необходимые права для этого действия.

# AppNCFCFGNotExists
source: File with graphical settings was not found. Please run the game at least once.
ru: Файл с графическими настройками игры не найден. Перед редактированием хотя бы один раз запустите игру!

# AppSafeClnStTextOff
source: BackUps: OFF
ru: Рез. копии: ВЫКЛ

# AppSafeClnStTextOn
source: BackUps: ON
ru: Рез. копии: ВКЛ

# AppSafeClnDisabled
source: Attention! You have disabled SafeClean module, so backups will not be created until its re-activation.
ru: Внимание! Вы отключили модуль безопасной очистки, поэтому резервные копии создаваться не будут до его повторной активации.

# CE_NoFileOpened
source: Open file to use this feature.
ru: Для использования этой функции откройте файл.

# AppCVListURL
source: http://developer.valvesoftware.com/wiki/Console_Command_List
ru: http://www.easycoding.org/projects/srcrepair/cvarlist

# AppAlreadyLaunched
source: {0} is already running. Starting the second copy is not allowed!
ru: Программа {0} уже запущена. Запуск второй копии невозможен!

# CE_BackUpCreated
source: Backup of {0} was successfully created!
ru: Резервная копия файла {0} была успешено создана!

# AppChangeLogin
source: Attention! On the selected Steam login we can't detect any installed supported games. Please select another login from list.
ru: Внимание! На выбранном логине Steam отсутствуют поддерживаемые игры. Пожалуйста выберите другой из списка.

# GT_NCFFailure
source: An error occurred while saving the game graphics settings into a file!
ru: Произошла ошибка во время сохранения графических настроек игры в файл!

# GT_NCFNReady
source: Warning! To save the graphical settings, you must fill in all the forms!
ru: Для сохранения графических настроек Вы должны заполнить все параметры!

# UPD_GamL_Latest
source: Update is not required because you have the latest version of the game database.
ru: Обновление не требуется, т.к. у Вас последняя версия базы данных игр.

# UPD_GamL_Updated
source: The game database has been updated successfully. Restart this program.
ru: База данных игр была успешно обновлена. Для её применения перезапустите программу.

# AHE_KRegErr
source: Unable to get path to the Hosts file from registry. Will try standard path.
ru: Не удалось получить путь к Hosts из реестра. Попробуем стандартный путь.

# AHE_NoFileDetected
source: The Hosts file on the resulting path {0} could not be found.
ru: Файл Hosts по полученному пути {0} не может быть найден.

# AppGenericError
source: Fatal error occurred! The application will be terminated.
ru: Внимание! Произошла критическая ошибка. Работа приложения остановлена.

# AppFeatureUnavailable
source: Sorry, but the selected feature is not available for this platform!
ru: Извините, но выбранная функция недоступна для этой платформы!
