Repository: Acidburn0zzz/srcrepair
Catalog: srcrepair/AppStrings.*.resx
Languages: ru

# AHE_NoAdminRights
source: Local admin rights is required to perform requested action!
ru: Для выполнения этого действия необходимы права локального администратора!

# BU_BType_Cont
source: Archive
ru: Архив

# BU_BudArchiveMsg
source: This file can not be restored directly from SRC Repair. Open it with any archiver and restore files manually.
ru: Этот тип файла не может быть восстановлен из SRC Repair. Откройте его в любом архиваторе и выполните восстановление самостоятельно.

# BU_UnknownType
source: Unknown file type. Can't restore!
ru: Отсутствуют правила для восстановления такого типа файлов!

# BU_BName_Bud
source: Archive of
ru: Архив от

# BU_BType_Video
source: Video
ru: Видео

# PS_ArchFailed
source: Warning! An error occured during packing files. Archive was not created!
ru: Произошла ошибка при упаковке файлов в архив. Архив не был создан!

# PS_CleanInProgress
source: Cleaning up...
ru: Выполняется...

# AppNoGamesSelected
source: Warning! No games selected. Select game and try again later.
ru: Не выбрано ни одной игры! Пожалуйста выберите в главном окне поддерживаемую игру, а затем повторите вызов функции.

# SteamNoLoginsDetected
source: An error occured! Unable to locate user folders inside SteamApps. Start at least one supported game from Steam and restart this program.
ru: Приложение обнаружило каталог SteamApps, однако в нём отсутствуют пользовательские каталоги. Запустите поддерживаемую игру из Steam хотя бы раз, затем перезапустите программу.

# PS_FrFInfo
source: We can free up to {0} hard-disk space after cleanup.
ru: В результате очистки может быть освобождено до {0}.

# AppStartSteamFailed
source: Unable to start Steam. Please reinstall and try again later.
ru: Не удалось запустить Steam. Проверьте правильность его установки и повторите попытку позднее!

# GT_RegOpenErr
source: Can not open registry key. Please start game at least once and try again.
ru: Произошла ошибка при открытии ключа реестра. Графические настройки не были загружены!

# UPD_ExtHashSum
source: Notice: Hash of existing file {0}: {1}.
ru: Сообщение: Хэш сумма существующего файла {0}: {1}.

# UPD_ProcFinMsg
source: The game database has been updated successfully.
ru: Обновление базы данных поддерживаемых игр завершено.

# UPD_ProcStartMsg
source: Updating the game database from server...
ru: Обновление базы данных поддерживаемых игр с сервера...

# UPD_RecvHashStr
source: Notice: Received server hash of the game database {0}.
ru: Сообщение: С сервера получен следующий хэш базы игр: {0}.

# AppNoGamesDLog
source: No games detected. Steam located as: {0}.
ru: Не найдено ни одной поддерживаемой игры. Steam расположен в каталоге: {0}.

# AppRestrSymbLog
source: NonASCII characters detected. Steam path: {0}.
ru: В пути обнаружены запрещённые символы: {0}.

# AppSteamLocLog
source: Steam found in: {0}.
ru: Steam обнаружен в каталоге: {0}.

# AppFailedToGetData
source: Warning! Failed to get data from game database. Please try again or select another game!
ru: Произошла ошибка при получении данных из базы поддерживаемых игр. Попробуйте ещё раз, либо выберите другую игру!

# AppGameChkErrNtExs
source: Game work directory "{0}" does not exists!
ru: Рабочий каталог "{0}" игры не существует!

# BR_SendCompleted
source: Bug report has been successfully sended!
ru: Сообщение об ошибке было успешно отправлено!

# BR_MsgFieldsEmpty
source: Empty fields detected. Fill them and try again!
ru: Не заполнены необходимые поля. Заполните и повторите попытку!

# BR_SendButtonAlt
source: Sending...
ru: Отправка...

# BR_SendError
source: Warning! An error occured. Please try again later!
ru: Во время отправки сообщения произошла ошибка. Попробуйте ещё раз позднее!

# BR_CaptErr
source: Incorrect CAPTCHA code entered. Try again!
ru: Неправильно введён текст с картинки. Повторите попытку!

# BU_BinaryFile
source: The selected file is a binary. Unable open it in text editor!
ru: Выбранный файл является бинарным, поэтому его невозможно открыть в текстовом редакторе!

# UPD_AppNoUpdates
source: No new updates detected. Your application is up to date.
ru: Нет новых обновлений программы. Установлена новейшая версия.

# UPD_AppUpdateAvail
source: Application update available. New version: {0}.
ru: Доступно обновление программы. Новая версия: {0}.

# UPD_DbNoUpdates
source: No new updates detected. SRC Repair is using latest version of game database.
ru: Нет новых обновлений базы игр. Используется свежайшая версия.

# UPD_DbUpdateAvail
source: Database update available. New version: {0}.
ru: Доступно обновление базы игр. Хеш новой версии: {0}.

# DB_WrkInProgress
source: Checking for updates. Please wait!
ru: Пожалуйста, дождитесь завершения проверки обновлений!

# PS_SteamRunning
source: Steam client is running! To execute this cleanup please close it.
ru: Обнаружен запущенный клиент Steam! Чтобы выполнить эту очистку завершите его работу.

# BU_BType_Unkn
source: Unknown
ru: Неизвестный

# BU_BName_Config
source: Game config of
ru: Конфиг игры от

# HD_InstallSuccessfull
source: HUD installation successfull!
ru: Установка HUD была успешно выполнена!

# HD_InstallError
source: Error occured during installation. Please try again later.
ru: При установке HUD произошла ошибка. Повторите попытку позднее.

# HD_InstallBtnProgress
source: Installing HUD... Wait.
ru: Идёт установка... Ждите.

# HD_AlreadyInstalled
source: Selected HUD already installed. If you want to reinstall, remove it first!
ru: Выбранный HUD уже установлен. Если хотите переустановить, сначала удалите его!

# UPD_HUDDb_Latest
source: Update is not required because you have the latest version of the HUD database.
ru: Обновление не требуется, т.к. у Вас последняя версия базы данных HUD.

# UPD_HUDDb_Updated
source: The HUD database has been updated successfully. Restart this program.
ru: База данных HUD была успешно обновлена. Для применения изменений просто выберите любую игру из списка, либо перезапустите программу.

# UPD_HUDNoUpdates
source: No new updates detected. SRC Repair is using latest version of HUD database.
ru: Нет новых обновлений базы HUD. Используется свежайшая версия.

# UPD_HUDUpdateAvail
source: HUD database update available. New version: {0}.
ru: Доступно обновление базы HUD. Хеш новой версии: {0}.

# AR_UnpackException
source: An error occured during unpacking selected archive. Additional information can be found in debug log.
ru: Во время распаковки произошла ошибка. Возможно, архив был распакован не до конца. Более подробная информация в журнале ошибок программы.

# PS_ProcessPrepare
source: Starting cleanup...
ru: Подготовка к запуску очистки...

# PS_ProgressArchive
source: Creating backup...
ru: Создание резервной копии...

# PS_ProgressCleanup
source: Cleanup in progress...
ru: Идёт очистка выбранных файлов...

# PS_ProgressFinished
source: Done.
ru: Очистка завершена.

# AppNoDebugFile
source: Debug log file not found!
ru: Файл отладочного журнала не найден!
