Repository: Acidburn0zzz/srcrepair
Catalog: srcrepair/FrmBRep.*.resx
Languages: ru

# BR_WlcMsg.Text
source: Report bug to developers
ru: Сообщить об ошибке

# BR_L_Title.Text
source: Title:
ru: Тема:

# BR_L_Category.Text
source: Select category from list:
ru: Выберите категорию:

# BR_Category.Items
source: Bug
ru: Сообщение об ошибке

# BR_Category.Items1
source: Feature request
ru: Предложение новой функции

# BR_Category.Items2
source: Task
ru: Задание для разработчиков

# BR_L_Message.Text
source: Describe the problem in details (as more as you can):
ru: Максимально подробно опишите возникшую проблему:

# BR_Send.Text
source: Send report
ru: Отправить

# BR_Cancel.Text
source: Cancel
ru: Отмена

# $this.Text
source: Report bug form
ru: Сообщить об ошибке в программе
